{
  "title": "DevOps Engineer",
  "company": "Gamma",
  "location": "Remote",
  "employment_type": "Full-time",
  "salary": "$2,200 - $2,500",
  "date_posted": "2023-03-15",
  "description": "We’re a fast-growing AI-driven business that provides growth solutions, specializing in automation, cold email outreach, and comprehensive growth strategies. As a DevOps Engineer you will take full ownership of the day-to-day operations of our cold email infrastructure. Your role will be critical in maintaining high deliverability, ensuring smooth operations, troubleshooting issues, and continuously improving our email systems to handle millions of emails per month. Key Responsibilities Infrastructure Management: Oversee the cold email infrastructure, ensuring optimal performance, security, and reliability. Maintenance & Troubleshooting: Handle maintenance tasks, diagnose and resolve issues related to mail queue buildup, latency, and email deliverability (SPF, DKIM, DMARC, etc.). Email Deliverability: Implement and maintain email deliverability protocols like SPF, DKIM, DMARC, and rDNS, and work on throttling and bounce handling to improve email outreach success. Mail Server Management: Manage and troubleshoot mail servers (Postfix, OpenSMTPD, etc.), ensuring smooth operations and quick issue resolution. Database Management: Manage and optimize PostgreSQL databases, with additional familiarity with key-value stores like FoundationDB for email data handling. Cloud Infrastructure: Work in a private cloud environment (e.g., DigitalOcean, Hetzner) to deploy, monitor, and scale infrastructure. Automation: Use automation tools like Ansible and Terraform to streamline processes and improve efficiency. Performance Optimization: Monitor and improve high-volume email systems to ensure smooth delivery and prevent performance bottlenecks. Collaboration & Documentation: Document processes and communicate effectively with other teams to ensure the smooth running of email systems.",
  "tech_skills": [
    "Linux Systems",
    "Postfix",
    "OpenSMTPD",
    "Python",
    "Ansible",
    "Terraform",
    "DigitalOcean",
    "Hetzner",
    "FoundationDB"
  ],
  "soft_skills": [
    "Problem-Solving & Troubleshooting",
    "Communication Skills",
    "Clear communication and strong documentation practices",
    "Collaboration & Documentation"
  ],
  "seniority": "Junior",
  "job_link": "https://gamma.app/docs/DevOps-Engineer-MJ-xow6m4hb8nsosqo?mode=doc"
}